{
  "architectures": [
    "MoEForCausalLM"
  ],
  "auto_map": {
	"AutoConfig": "configuration_moe.MoEConfig",
	"AutoModelForCausalLM": "modeling_moe.MoEForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "expert_frequency": 1,
  "experts_topk": 0,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "intermediate_size": 2816,
  "max_position_embeddings": 2048,
  "model_type": "llama",
  "num_attention_heads": 16,
  "num_experts": 16,
  "num_hidden_layers": 24,
  "num_key_value_heads": 16,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "tokenizer_class": "LlamaTokenizer",
  "top_p_threshold": 0.4,
  "transformers_version": "4.33.1",
  "use_cache": true,
  "vocab_size": 32000
}
